app/controllers/main_controller.rb

SELECT "pools".* FROM "pools" ORDER BY "pools"."cg_id" ASC
---
  def index
    @summary = CgminerApi.call("summary")
    if @summary.include?("CGMiner is not running.")
      @not_running = true
    else
      @db_pools = Pool.order(:cg_id).to_a