app/controllers/pools_controller.rb

SELECT "pools".* FROM "pools" ORDER BY "pools"."cg_id" ASC
SELECT MAX("pools"."cg_id") FROM "pools"
INSERT INTO "pools" ("cg_id", "url", "user", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cg_id", 0], ["url", "stratum+tcp://bch.viabtc.com:3333"], ["user", "scilence2020.001"], ["created_at", "2021-01-25 04:48:30.159141"], ["updated_at", "2021-01-25 04:48:30.159141"]]
---
  def create
    @pool = Pool.new(pool_params)
    if Pool.maximum("cg_id").nil?
      @pool.cg_id = 0
    else
      @pool.cg_id = Pool.maximum("cg_id") + 1
    end

    if @pool.save

DELETE FROM "pools" WHERE "pools"."id" = ?  [["id", 165]]
INSERT INTO "pools" ("cg_id", "url", "user", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cg_id", 0], ["url", "stratum+tcp://bch.viabtc.com:3333"], ["user", "scilence2020.001"], ["created_at", "2021-01-25 05:06:45.904468"], ["updated_at", "2021-01-25 05:06:45.904468"]]
---
  def update
    @pool.delete
    @pool = Pool.new(pool_params)
    @pool.cg_id = 0
    if @pool.save

DELETE FROM "pools" WHERE "pools"."id" = ?  [["id", 8]]
---
  def destroy
    @pool.delete

SELECT "pools".* FROM "pools" WHERE "pools"."id" = ? LIMIT ?  [["id", 173], ["LIMIT", 1]]
---
    def set_pool
      begin
        @pool = Pool.find(params[:id])