app/models/pool.rb

SELECT "pools".* FROM "pools" ORDER BY "pools"."cg_id" ASC
---
  def add_pool
    add_pool = CgminerApi.call("addpool|#{self.url},#{self.user},#{self.pass}")
    save_config = CgminerApi.call("save|#{Rails.root.join('cgminer.conf')}")